receita-apiruby/app/controllers/items_controller.rb

INSERT INTO "items" ("name", "itemType", "value", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "teste"], ["itemType", "testador"], ["value", 35.23], ["user_id", 1], ["created_at", 2017-04-05 18:35:11 UTC], ["updated_at", 2017-04-05 18:35:11 UTC]]
---
	def create
		@user.items.create!(item_params)

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
	def set_user_item
		@item = @user.items.find_by!(id: params[:id]) if @user